//@ts-nocheck
import React from "react";
import styles from "./AgreementPolicy.css";

function PrivacyRight() {
    return (
        <div className={styles.main}>
            <div className={styles.header}>
                <img src="images/left-crow.png" id="back" onClick={() => window.history.go(-1)} />
                <span><i>地藤</i></span>
            </div>
            <div className={styles.isNode}><h1><span>隐私协议</span></h1>
                <p><span>生效时间：2020-01-01</span></p>
                <p><span>更新时间：2022-06-24</span></p>
                <p><span>本协议适用于我公司旗下的地藤系列产品。</span></p>
                <p><span>深圳市华软资讯科技有限公司（“深圳华软”或“我们”）以及地藤App（“本App”）深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。</span></p>
                <p><span>我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。</span></p>
                <p><span>本隐私政策("隐私政策")与我们所提供的产品和服务密切相关。我们努力通过明确、易懂和适宜方式向您说明我们是如何收集、使用、保存和转移来自于或关于您的信息，我们建议您仔细阅读以便您了解自己的权利并做出您的选择。</span></p>
                <p><span>本声明的全部条款属于《地藤用户协议》的重要组成部分之一。一旦您浏览访问地藤App或者选择同意注册用户使用地藤的服务，即表示您已全面阅读，知悉本声明的内容，并同意做出相应的授权。本声明在您使用网站和服务的整个过程中有效，如果您对本声明有任何疑问、意见或建议，您可联系我们咨询反馈。如果您不同意本声明，您应立即停止使用地藤所提供的产品和服务。</span>
                </p>
                <p><span>如果您有任何疑惑、意见或建议，我们非常乐于听取并欢迎您通过本政策载明的联系方式与我们取得联系，我们将为您解答。</span></p>
                <p><span>本政策将帮助您了解以下内容：</span></p>
                <p><span>1、定义</span></p>
                <p><span>2、我们如何收集和使用您的个人信息</span></p>
                <p><span>3、我们如何使用Cookie和同类技术</span></p>
                <p><span>4、我们如何共享、转让、公开披露您的个人信息</span></p>
                <p><span>5、我们如何保护您的个人信息</span></p>
                <p><span>6、您的权利</span></p>
                <p><span>7、我们如何处理您的个人信息</span></p>
                <p><span>8、适用范围</span></p>
                <p><span>9、本政策如何更新</span></p>
                <p><span>10、联系方式</span></p>

                <h2><span>1、定义</span></h2>
                <p><span>1.1</span></p>
                <p><span>“地藤”或“我们”:除非另有特别说明，在本政策中指深圳市华软资讯科技有限公司。</span></p>
                <p><span>1.2</span></p>
                <p><span>“第三方”：指并非因为和我们有共同所有权或控制权而存在相关关系的公司或人（即非关联公司）或者其他非相关的个人。</span></p>
                <p><span>1.3</span></p>
                <p><span>“个人信息”：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策所指个人信息请见“我们如何收集和使用您的个人信息”这一条款中的所一一列明的类型。</span>
                </p>
                <p><span>1.4</span></p>
                <p><span>“个人敏感信息”：指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中涉及的个人敏感信息可能包括：您的财产信息（包括银行帐号及充值信息等虚拟财产信息）；个人身份信息（包括身份证）；网络身份识别信息（包括账户名、账户昵称、邮箱地址及与前述有关的密码）；其他信息（包括通讯录、个人电话号码、手机号码、行程信息、网页浏览记录、住宿信息、精准定位信息）。对于本隐私政策中列示的如上个人敏感信息，为便于您在阅读时有所警觉，我们除在此统一定义并列示外，另仍然会在本隐私政策中以字体加粗、加下划线，或单独指出等突出显示的方式再行提示您注意。</span>
                </p>
                <p><span>1.5</span></p>
                <p><span>“非个人信息”：指不能识别或关联个人的信息。包括匿名化信息（不可复原），以及作为企业用户中业已由相关主管部门公示披露的全部非个人信息（例如企业联系地址、联系方式、营业年限、企业规模、从事行业、主营业务、主要产品、网站域名等）。</span>
                </p>
                <h2><span>2、我们如何收集和使用您的个人信息</span></h2>
                <p><span>我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：</span></p>
                <p><span>2.1 帮助您注册成为地藤用户</span></p>
                <p><span>为助您成为地藤用户，以便我们为您提供注册用户服务（例如成为注册用户后即可登录个人中心查看各类信息，或有资格参与优惠政策等用户活动），您将通过地藤中的注册页面注册帐号。您在注册帐号的过程中，您会向我们直接提供手机号码、您设定的密码（加密）、手机验证码之个人敏感信息，您提供的手机号码在注册成功后将作为您之后登录我们服务的登录帐号，并且我们使用手机号码这类个人信息发送验证码信息以供您提交验证身份是否有效以及进行密码找回。</span>
                </p>
                <p><span>您知悉，我们收集手机号码、电子邮箱地址信息是为了满足相关法律法规的网络实名制要求，若您不提供这类信息，将无法正常使用我们的注册用户服务。当然，在注册过程中，您也可以选择提供您的现居省份和现居城市信息，以便于我们向您提供更为优质的服务，您若不提供该类信息并不会影响您的注册流程并使用我们的注册用户服务。</span>
                </p>
                <p><span>如果您已经登录了自己的地藤帐号，则您可以在登录帐号后向我们提供并完善您的昵称、联系地址、QQ 号、个人网址信息，您可选择拒绝提供该类信息，这不影响您正常使用地藤注册用户功能，如果您选择提供，我们均视为可关联的个人信息予以保护。</span>
                </p>
                <p><span>我们亦友情提示您，即使您不向我们提供任何个人信息，您也能够完全浏览我们官方网站的所有公开信息。</span></p>
                <p><span>2.2 为您提供地藤技术服务</span></p>
                <p><span>2.2.1</span></p>
                <p><span>您直接向我们提供的信息</span></p>
                <p><span>为向您提供我们的基础核心技术服务（包括对象存储、云主机、云数据库、CDN、内容审核等，具体请详见地藤官方网站所实时展示的服务内容），我们向您提供了多种实名认证形式。</span></p>
                <p><span>您应当知悉，地藤各类技术服务均属于我们的基础核心业务功能，如果您不提供上述列示的个人信息并通过实名认证，您将无法享受我们提供的基础核心技术服务。</span></p>
                <p><span>2.2.2</span></p>
                <p><span>在您使用服务过程中我们收集的信息</span></p>
                <p><span>为实现我们的核心技术服务，我们另可能会在您使用服务过程中，收集您的如下信息，我们可能收集：</span></p>
                <p><span>1) 设备信息：包括设备名称、设备型号、设备设置、识标符、地区和语言设置、使用习惯、操作系统版本以及用于访问服务的设备的设置、设备异常信息；</span></p>
                <p><span>2) 日志信息：当您使用我们的网站或相关客户端提供的服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。包括您的搜索查询内容、IP 地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网页记录；</span>
                </p>
                <p><span>3) 位置信息：包括设备的 GPS 信号或附近的 WiFi 接入点的相关信息、设备定位所在区域 ID、网络服务提供商 ID。</span></p>
                <p><span>请注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。但是，如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，例如将以上信息和您的帐号相关联时，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。</span>
                </p>
                <p><span>2.3 为您提供互动功能和发出业务通知</span></p>
                <p><span>当您通过地藤与我们或其他用户进行通信、反馈、分享等互动时，我们将收集并使用您提交的姓名（昵称）、手机号码、电子邮箱地址等联系信息。</span>
                </p>
                <p><span>我们将在用户协议或隐私权政策更新后及时向您发出通知以保障您的权益。另外，我们将通过您的联系信息告知您和其它用户之间的互动回复结果，告知您帐号实名认证结果反馈、权利人或用户的投诉举报通知以及解决您反馈的问题等。</span>
                </p>
                <p><span>2.4 安全管理功能;</span></p>
                <p><span>为向您提供安全稳定的服务、保障您的账户财产安全、预防冒名登录，我们需要记录您的设备型号、IP 地址、设备软件版本信息、设备识别码。如果您不同意我们记录前述信息，可能无法完成风控验证，而无法使用我们的软件。</span>
                </p>
                <p><span>产品业务功能收集使用您的信息逐项列举如下表所示：</span></p>
                <p><span>Android:</span></p>
                <div>
                    <table>
                        <thead>
                            <tr>
                                <th>具体场景</th>
                                <th>收集数据类型</th>
                                <th>个人信息</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>发送日志 </td>
                                <td>个人常用设备信息、个人通信信息、个人基本资料</td>
                                <td>设备信息、唯一设备识别码、 IMEI、IMSI、Android_id</td>
                            </tr>
                            <tr>
                                <td>推送</td>
                                <td>个人上网记录</td>
                                <td>设备信息、关注记录</td>
                            </tr>
                            <tr>
                                <td>记账</td>
                                <td>个人基本资料、网络身份标识信息</td>
                                <td>个人信息主体账号</td>
                            </tr>
                            <tr>
                                <td>搜索</td>
                                <td>个人上网记录</td>
                                <td>搜索记录、浏览记录、点击记录</td>
                            </tr>
                            <tr>
                                <td>关注、收藏</td>
                                <td>个人上网记录、网络身份标识信息</td>
                                <td>关注记录、个人信息主体账号</td>
                            </tr>
                            <tr>
                                <td>手机号注册</td>
                                <td>个人基本资料、网络身份标识信息</td>
                                <td>手机号、个人信息主体账号、验证码</td>
                            </tr>
                            <tr>
                                <td>登录</td>
                                <td>个人基本资料、网络身份标识信息</td>
                                <td>手机号（手机号登录时所需）、个人主体账号信息及相关数字口令信息、登录密码</td>
                            </tr>
                            <tr>
                                <td>个人主页设置</td>
                                <td>网络身份标识信息、个人上网记录</td>
                                <td>个人信息主体账号、头像、昵称、签名、操作记录</td>
                            </tr>
                        </tbody>
                    </table>
                </div>
                <p>iOS:</p>
                <div class="responsive-table">
                    <table>
                        <thead>
                            <tr>
                                <th>具体场景</th>
                                <th>收集数据类型</th>
                                <th>个人信息</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>发送日志 </td>
                                <td>个人常用设备信息、个人通信信息、个人基本资料</td>
                                <td>设备信息、电话号码</td>
                            </tr>
                            <tr>
                                <td>推送</td>
                                <td>个人上网记录</td>
                                <td>设备信息、关注记录</td>
                            </tr>
                            <tr>
                                <td>记账</td>
                                <td>个人基本资料、网络身份标识信息</td>
                                <td>个人信息主体账号</td>
                            </tr>
                            <tr>
                                <td>搜索</td>
                                <td>个人上网记录</td>
                                <td>搜索记录、浏览记录、点击记录</td>
                            </tr>
                            <tr>
                                <td>关注、收藏</td>
                                <td>个人上网记录、网络身份标识信息</td>
                                <td>关注记录、个人信息主体账号</td>
                            </tr>
                            <tr>
                                <td>手机号注册</td>
                                <td>个人基本资料、网络身份标识信息</td>
                                <td>手机号、个人信息主体账号、验证码</td>
                            </tr>
                            <tr>
                                <td>登录</td>
                                <td>个人基本资料、网络身份标识信息</td>
                                <td>手机号（手机号登录时所需）、个人主体账号信息及相关数字口令信息、登录密码</td>
                            </tr>
                            <tr>
                                <td>个人主页设置</td>
                                <td>网络身份标识信息、个人上网记录</td>
                                <td>个人信息主体账号、头像、昵称、签名、操作记录</td>
                            </tr>
                        </tbody>
                    </table>
                </div>
                <p><span>2.5、您在使用本软件时，为提供给您服务之目的，本软件可能获取您终端设备的如下权限，当然您可以拒绝开启以下权限，或在手机的设置中关闭本软件的以下权限，关闭以下权限不会影响您对本软件其他功能的使用：</span></p>
                <ul>
                    <li>访问相机：您可以使用摄像头扫码进行扫一扫、直接拍摄并上传图片进行晒图或分享；</li>
                    <li>访问照片：您可以直接选择手机内的照片或图片进行上传评论或与客服沟通时提供证明；</li>
                    <li>开启推送：您可以通过开启推送权限来接收 App 推送的消息；</li>
                    <li>开启无线数据：您可以通过连接无线网络或开启蜂窝网络来实现本软件需要的联网功能；</li>
                    <li>访问安装程序列表：通过获取您的安装程序列表我们可以确认您是否安装了我们所推广的软件，以便我们及时向您发放相应奖励；</li>
                    <li>开启麦克风和语音识别：您可以通过语音来控制本软件的语音朗读功能及语音控制功能；</li>
                </ul>
                <p><span>2.6、第三方 SDK 接入服务所需开通的权限。我们的产品和服务可能包括第三方的产品和服务，以及第三方网站的链接。当您使用这些产品或服务时，也可能收集您的信息。</span></p>
                <p><span>独立的第三方通过SDK获取您的个人信息的情况：</span></p>
                <div>
                    <table>
                        <thead>
                            <tr>
                                <th>第三方SDK名称</th>
                                <th>使用目的</th>
                                <th>权限</th>
                                <th>收集数据类型</th>
                                <th>个人信息</th>
                                <th>是否传输个人信息</th>
                                <th>第三方机构名称</th>
                                <th>隐私政策链接</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>微信分享</td>
                                <td>微信登录，帮助用户分享内容至第三方应用</td>
                                <td>网络访问权限</td>
                                <td>设备识别信息</td>
                                <td>IMEI、 MAC</td>
                                <td>是</td>
                                <td>腾讯科技(深圳)有限公司</td>
                                <td><a href="https://privacy.qq.com">查看</a></td>
                            </tr>
                            <tr>
                                <td>华为PUSH</td>
                                <td>推送消息</td>
                                <td>网络访问权限、查看wlan连接、访问GSM网络信息、写入外部存储卡</td>
                                <td>设备识别信息</td>
                                <td>IMEI</td>
                                <td>是</td>
                                <td>华为软件技术有限公司</td>
                                <td><a href="https://consumer.huawei.com/cn/privacy/privacy-policy/?spm=a1zaa.8161610.0.0">查看</a></td>
                            </tr>
                            <tr>
                                <td>小米PUSH</td>
                                <td>推送消息</td>
                                <td>网络访问权限、改变网络连接状态、访问GSM网络信息、写入外部存储卡、读取手机状态及身份、查看wlan连接</td>
                                <td>设备识别信息</td>
                                <td>IMEI</td>
                                <td>是</td>
                                <td>小米科技有限责任公司</td>
                                <td><a href="https://dev.mi.com/console/doc/detail?pId=1822">查看</a></td>
                            </tr>
                            <tr>
                                <td>OPPO PUSH</td>
                                <td>推送消息</td>
                                <td>网络访问权限、改变网络连接状态、访问GSM网络信息、写入外部存储卡、读取手机状态及身份、查看wlan连接</td>
                                <td>设备识别信息</td>
                                <td>IMEI</td>
                                <td>是</td>
                                <td>OPPO广东移动通信有限公司</td>
                                <td><a href="https://privacy.oppo.com/cn/policy/">查看</a></td>
                            </tr>
                            <tr>
                                <td>极光 PUSH</td>
                                <td>推送信息</td>
                                <td>网络访问权限、改变网络连接状态、访问GSM网络信息、写入外部存储卡、读取手机状态及身份、查看wlan连接</td>
                                <td>设备识别信息</td>
                                <td>IMEI</td>
                                <td>是</td>
                                <td>深圳市和讯华谷信息技术有限公司</td>
                                <td><a href="https://www.jiguang.cn/license/privacy">查看</a></td>
                            </tr>
                            <tr>
                                <td>AndroidSupportLi brary</td>
                                <td>兼容函数库，它使得开发者可以提升设计开发 效果</td>
                                <td>无</td>
                                <td>无</td>
                                <td>无</td>
                                <td>否</td>
                                <td>Google</td>
                                <td><a href="https://code.google.com/">查看</a></td>
                            </tr>
                        </tbody>
                    </table>
                </div>
                <p><span>2.4 改善我们的产品或服务</span></p>
                <p><span>为了改善我们的产品、服务并开发给您更好的服务，我们将会使用您的个人信息。但您应当知悉的是，一般情况下，我们为此目的仅使用采用匿名化处理后的综合信息和统计性信息，并不会识别到您个人，我们将会利用此类信息进行数据分析和研究及开展审计。</span>
                </p>
                <p><span>2.5 为您提供安全保障</span></p>
                <p><span>我们所收集的个人信息将用于确保我们产品和服务的安全性和可靠性，并防范网络欺诈、网络攻击和入侵等，更准确地识别违反法律法规或地藤相关协议规则的情况。我们可能使用或整合您的帐号信息、设备信息、软件使用信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，用于进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。</span>
                </p>
                <p><span>2.7 征得您授权同意的例外</span></p>
                <p><span>根据相关法律法规及个人信息保护规范的规定，在以下情形中，我们收集、使用个人信息无需征得您的授权同意：</span></p>
                <p><span>2.7.1</span></p>
                <p><span>与国家安全、国防安全有关的；</span></p>
                <p><span>2.7.2</span></p>
                <p><span>与公共安全、公共卫生、重大公共利益有关的；</span></p>
                <p><span>2.7.3</span></p>
                <p><span>与犯罪侦查、起诉、审判和判决执行等有关的；</span></p>
                <p><span>2.7.4</span></p>
                <p><span>出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；</span></p>
                <p><span>2.7.5</span></p>
                <p><span>所收集的个人信息是您自行向社会公众公开的；</span></p>
                <p><span>2.7.6</span></p>
                <p><span>从合法公开披露信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</span></p>
                <p><span>2.7.7</span></p>
                <p><span>根据您的要求签订合同所必需的；</span></p>
                <p><span>2.7.8</span></p>
                <p><span>用于维护我们产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</span></p>
                <p><span>2.7.9</span></p>
                <p><span>对您个人信息进行技术处理，使您的主体无法被识别，且处理后的信息不能被复原的信息（不属于个人信息）；或对您个人信息进行去标识化技术处理并保障安全的情况下；</span></p>
                <p><span>2.7.10</span></p>
                <p><span>法律法规或相关规范规定的其他情形。</span></p>

                <h2><span>3、我们如何使用 Cookie 和同类技术</span></h2>
                <p><span>3.1 Cookie</span></p>
                <p><span>为确保地藤正常运转、为您获得更轻松的访问体验，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。例如，借助于 Cookie，网站及客户端能够存储您的注册帐号、邮箱、密码（加密）和偏好等数据，Cookie 还可以帮助我们统计流量信息，分析页面设计。</span>
                </p>
                <p><span>地藤启用 Cookie 的目的与大多数网站或互联网服务提供商启用 Cookie 的目的一样，即改善用户体验。我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以通过各类不同浏览器自带的功能清除设备上保存的所有 Cookie，但如果您这么做，则需要在每一次使用地藤时亲自更改用户设置。您可通过自行修改您设备浏览器设置的方式拒绝或管理 Cookie。</span>
                </p>
                <h2><span>4、我们如何披露 / 共享、转让您的个人信息</span></h2>
                <p><span>4.1 何时披露共享以及可能向谁披露 / 共享</span></p>
                <p><span>未经您的同意，我们将不会向第三方披露或共享您的信息。在获取您的同意后，为了向您提供服务，在以下情况下，我们可能向下列实体披露或共享您的信息：</span></p>
                <p><span>4.1.1</span></p>
                <p><span>在获得您（以及监护人）的明确同意或授权或您主动选择的情况下共享。</span></p>
                <p><span>4.1.2</span></p>
                <p><span>在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享披露您的个人信息。例如，如果我们确定您出现违反法律法规或严重违反地藤相关协议规则的情况，或为保护地藤及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或平台相关协议规则披露关于您的个人信息，包括相关违规行为以及地藤平台已对您采取的措施。例如，若您使用的帐号或对您用户上传非法视频、违规视频等任何内容而严重违反我方平台规则、触犯法律法规和/或违背公序良俗，造成重大社会影响，给我方平台造成声誉损失，我们可能会公开披露您的信息与处罚情况。</span>
                </p>
                <p><span>4.2 转让信息及例外</span></p>
                <p><span>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</span></p>
                <p><span>4.2.1</span></p>
                <p><span>在获取明确同意的情况下转让。</span></p>
                <p><span>4.2.2</span></p>
                <p><span>在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受此隐私权政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。</span></p>
                <p><span>4.3 公开披露</span></p>
                <p><span>我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息：</span></p>
                <p><span>4.3.1</span></p>
                <p><span>根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息。</span></p>
                <p><span>4.3.2</span></p>
                <p><span>根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都将进行慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。</span>
                </p>
                <p><span>4.4 共享、转让、公开披露用户信息时事先征得授权同意的例外</span></p>
                <p><span>以下情形中，共享、转让、公开披露您的用户信息无需事先征得您的授权同意：</span></p>
                <p><span>4.4.1</span></p>
                <p><span>与国家安全、国防安全有关的；</span></p>
                <p><span>4.4.2</span></p>
                <p><span>与公共安全、公共卫生、重大公共利益有关的；</span></p>
                <p><span>4.4.3</span></p>
                <p><span>与犯罪侦查、起诉、审判和判决执行等有关的；</span></p>
                <p><span>4.4.4</span></p>
                <p><span>出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</span></p>
                <p><span>4.4.5</span></p>
                <p><span>您自行向社会公众公开或向交易对手提供的个人信息；</span></p>
                <p><span>4.4.6</span></p>
                <p><span>从合法公开披露的信息中收集个人信息的，如新闻报道、政府信息公开等渠道；</span></p>
                <p><span>4.4.7</span></p>
                <p>
                    <span>评价信息或法律法规规定必须披露的信息。例如云市场为构建诚信交易环境，您的信用评价信息（星级、客户评价）需要被公开分享。若您是服务商，您应当根据适用的法律法规和市场规则的要求，公开分享企业或者自然人经营者的相关信息；</span>
                </p>
                <p><span>4.4.8</span></p>
                <p><span>其他法律法规等规定的情形。</span></p>
                <h2><span>5、我们如何保护您的个人信息</span></h2>
                <p><span>5.1 安全的例外</span></p>
                <p><span>我们采取了合理的实际措施和技术措施，以保护所收集的与服务有关的信息。但是请注意，虽然我们采取了合理的措施保护您的信息，但没有任何网站、Internet 传输、计算机系统或无线连接是绝对安全的。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即联络在线客服，以便我们采取相应措施。</span>
                </p>
                <p><span>5.2 我们采取的安全措施</span></p>
                <p><span>我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。我们特别采取了以下措施：</span></p>
                <p><span>5.2.1</span></p>
                <p><span>我们会将收集的您的个人信息进行去标识化处理，从而降低其他组织或个人通过去标识化个人信息识别到您的风险。我们使用 SSL 对许多服务进行加密。我们会审查信息收集、存储和处理方面的做法（包括物理性安全措施），以避免各种系统遭到未经授权的访问。</span>
                </p>
                <p><span>5.2.2</span></p>
                <p><span>我们只允许那些为了帮我们处理个人信息而需要知晓这些信息的地藤员工、授权代为处理的服务公司的人员访问个人信息，而且他们需要履行严格的合同保密义务，且适时进行相关安全培训，如果其未能履行这些义务，就可能会被追究法律责任或被终止其与地藤的关系。</span>
                </p>
                <p><span>5.2.3</span></p>
                <p><span>对我们来说，您的信息的安全非常重要。因此，我们将不断努力保障您的个人信息安全，并实施存储和传输全程安全加密等保障手段，以免您的信息在未经授权的情况下被访问、使用或披露。同时某些加密数据的具体内容，除了用户自己，其他人都无权访问。</span>
                </p>
                <p><span>我们在传输和存储您的个人敏感信息时，会采用加密等安全措施；存储个人生物识别信息时，将采用技术措施处理后再进行存储，例如仅存储个人生物识别信息的摘要。</span></p>
                <p><span>5.3 安全事件应急处置</span></p>
                <p><span>在发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</span>
                </p>
                <p><span>5.4 保存期限和地域</span></p>
                <p><span>您在使用地藤期间，我们将持续为您保存您的个人信息，但相关信息将以实现目的所必需的最小化时间进行保存，否则，我们将对个人信息进行源数据及备份数据的删除或匿名化处理。如果您注销帐号或主动删除上述信息，地藤将依据网络安全法等法律法规规定在您删除后 6 个月内继续保存您的信息。</span>
                </p>
                <p><span>地藤会按照法律法规的规定，将在境内运营过程中收集和产生的个人信息存储于中华人民共和国境内，且不会将该等信息向境外进行传输。如地藤因业务发展需要，需向境外进行传输的，将明确告知并征得您的同意。</span>
                </p>
                <h2><span>6、您的权利</span></h2>
                <p><span>6.1 个人信息访问权</span></p>
                <p><span>您有权访问您的个人信息，但法律法规规定的例外情况除外。如果您想行使数据访问权，可以在地藤网站来登录您的帐号。具体而言，您可以通过在地藤“个人面板-个人信息”访问您帐号下的信息内容。</span></p>
                <p><span>6.2 个人信息更正权</span></p>
                <p><span>当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正或自行通过登录帐号更正，通过在地藤“个人面板-个人信息/安全设置”更改您的个人信息。在更新您的个人信息时，我们可能会要求您先验证自己的身份（如向您电子邮箱或手机号码发送验证信息），然后再处理您的请求。</span>
                </p>
                <p><span>6.3 个人信息删除权。在以下情形中，您可以向我们提出删除个人信息的请求：</span></p>
                <p><span>6.3.1</span></p>
                <p><span>如果我们处理个人信息的行为违反法律法规；</span></p>
                <p><span>6.3.2</span></p>
                <p><span>如果我们收集、使用您的个人信息，却未征得您的同意；</span></p>
                <p><span>6.3.3</span></p>
                <p><span>如果我们处理个人信息的行为违反了与您的约定；</span></p>
                <p><span>6.3.4</span></p>
                <p><span>如果您不再使用我们的产品或服务，或您注销了帐号；</span></p>
                <p><span>6.3.5</span></p>
                <p><span>如果我们不再为您提供产品或服务。</span></p>
                <p><span>6.4 改变您授权同意的范围</span></p>
                <p><span>每个业务功能需要一些基本的个人信息或设备权限才能得以完成。对于额外收集的个人信息的收集和使用，以及您当时认为不必要的设备权限，您可以随时通过在线客服或以站内信的方式给予或收回您的授权同意，我们会及时给以回复。当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。</span>
                </p>
                <p><span>6.5 个人信息主体注销帐号</span></p>
                <p><span>在您的帐号内无资源、无任何未支付的费用、无争议纠纷时，您可通过提交工单注销帐号。请注意，您注销帐号的行为是不可逆的行为，在注销帐号之后，您将无法通过已注销的帐号获得地藤商城提供产品或服务，我们将会在15个工作日内删除或匿名化有关您帐号的一切信息，发送邮件通知您，并保证这些信息不会泄露，但法律法规另有规定要求保存的数据除外。</span>
                </p>
                <p><span>6.6 个人信息主体获取个人信息副本</span></p>
                <p><span>在法律法规允许的范围内，您有权获取您的个人信息副本，您可通过联系在线客服进行处理。在技术可行、成本合理的的前提下，我们还可按您的明确要求，直接将您的个人信息副本传输给您指定的第三方。</span></p>
                <p><span>6.7 约束信息系统自动决策</span></p>
                <p><span>在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。</span></p>
                <p><span>6.8 投诉举报及响应</span></p>
                <p>
                    <span>当您有其他的投诉、建议或相关问题时，请通过本政策的联系方式与我们公司联系。我们将尽快审核所涉问题，并在验证您的用户身份后及时予以回复，一般在三十天内作出答复。当然，如您不满意，您也可以通过向主管机关提出投诉举报。</span>
                </p>
                <p><span>对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。此外，如果您的请求直接涉及国家安全、国防安全、公共卫生、犯罪侦查等和公共利益直接相关的事由，或者可能导致您或者其他个人、组织的合法权益受到严重损害，我们可能无法响应您的请求。</span>
                </p>
                <p><span>6.9 有权获得停止运营的告知</span></p>
                <p><span>如果地藤终止服务或运营，我们将及时停止收集您个人信息的活动，并且会至少提前三十日将停止运营的通知以逐一送达或公告的形式通知您，并在终止服务或运营后对所持有的您的个人信息进行删除或匿名化处理。</span></p>
                <h2><span>7、我们如何处理儿童的个人信息</span></h2>
                <p><span>地藤产品和服务主要面向非自然人。如果没有父母或监护人的同意，儿童不得创建自己的用户帐号。对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。您注意，我们将不满 14 周岁的任何人均视为儿童。</span>
                </p>
                <p><span>如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。</span></p>
                <h2><span>8、适用范围</span></h2>
                <p><span>为确保流畅的地藤使用体验，您可能会收到来自第三方提供的内容或网络链接。我们对此类第三方无控制权。您可选择是否访问第三方提供的链接、内容、产品和服务。我们无法控制第三方的隐私和数据保护政策，此类第三方不受到本政策的约束。在向第三方提交个人信息之前，请参见这些第三方的隐私保护政策。</span>
                </p>
                <h2><span>9、本政策如何更新</span></h2>
                <p><span>我们的隐私政策可能变更。</span></p>
                <p><span>未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。我们会通过 App 发出更新版本或以其他适当方式提醒您相关内容的更新。</span></p>
                <p><span>对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于 APP 推送通知或在浏览页面做特别提示的方式，说明隐私政策的具体变更内容）。</span></p>
                <p><span>本政策所指的重大变更包括但不限于：</span></p>
                <p><span>1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</span></p>
                <p><span>2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</span></p>
                <p><span>3、个人信息共享、转让或公开披露的主要对象发生变化；</span></p>
                <p><span>4、您参与个人信息处理方面的权利及其行使方式发生重大变化；</span></p>
                <p><span>5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</span></p>
                <p><span>6、个人信息安全影响评估报告表明存在高风险时。我们还会将本政策的旧版本存档，供您查阅。</span></p>
                <h2><span>10、联系方式</span></h2>
                <p><span>客服电子邮件：support@mimrc.com</span></p>
                <p><span>您对地藤及本隐私权政策有任何疑惑、意见或建议，您可通过拨打客服热线的方式来取得我们的联系。</span></p>
                <p><span>为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份后处理您的请求。</span></p>
                <p><span>虽然本隐私权政策容许调整，但是未经您同意，我们不会削弱您按照本隐私权政策所应享有的权利，除非通过您提供的电子邮件地址向您发送通知或发布网站公告。</span></p>
                <p><span>本政策的解释及争议解决均应适用中华人民共和国大陆地区法律。与本政策相关的任何纠纷，双方应协商友好解决；若不能协商解决，您同意将争议提交至中国国际经济贸易仲裁委员会仲裁。本政策的标题仅为方便及阅读而设，并不影响正文其中任何规定的含义或解释。</span></p>
            </div>
        </div>
    )
}

export default class FrmPrivacyRight extends React.Component {
    constructor() {
        super();
    }

    render(): React.ReactNode {
        return <PrivacyRight />
    }

    componentDidMount() {
        if (window.ApiCloud.isApiCloud()) {
            window.ApiCloudExec.exec(function () {
                api.execScript({
                    script: "hideHeader(false, 'main');"
                })
            })
            window.ApiCloudExec.exec(function () {
                if (api.frameName == 'agreement') {
                    api.execScript({
                        script: "showCloseIcon();"
                    })
                }
            })
            if (document.querySelector(`.${styles.header}`))
                document.querySelector(`.${styles.header}`).remove();
            if (document.querySelector(`.${styles.isNode}`))
                document.querySelector(`.${styles.isNode}`).style.paddingTop = 0;
        }
    }
}